### Import data

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("clean_coffee_shop_sales.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149116 entries, 0 to 149115
Data columns (total 13 columns):
 #   Column             Non-Null Count   Dtype
---  ------             --------------   -----
 0   Unnamed: 0         149116 non-null  int64
 1   transaction_id     149116 non-null  int64
 2   transaction_date   149116 non-null  object
 3   transaction_time   149116 non-null  object
 4   transaction_qty    149116 non-null  int64
 5   store_id           149116 non-null  int64
 6   store_location     149116 non-null  object
 7   product_id         149116 non-null  int64
 8   unit_price         149116 non-null  float64
 9   product_category   149116 non-null  object
 10  product_type       149116 non-null  object
 11  product_detail     149116 non-null  object
 12  transaction_month  149116 non-null  int64
dtypes: float64(1), int64(6), object(6)
memory usage: 14.8+ MB

In [4]:
df.head()

,transaction_id,transaction_date,transaction_time,transaction_qty,store_id,store_location,product_id,unit_price,product_category,product_type,product_detail
0,1,2023-01-01,07:06:11,2,5,Lower Manhattan,32,3.0,Coffee,Gourmet brewed coffee,Ethiopia Rg
1,2,2023-01-01,07:08:56,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg
2,3,2023-01-01,07:14:04,2,5,Lower Manhattan,59,4.5,Drinking Chocolate,Hot chocolate,Dark chocolate Lg
3,4,2023-01-01,07:20:24,1,5,Lower Manhattan,22,2.0,Coffee,Drip coffee,Our Old Time Diner Blend Sm
4,5,2023-01-01,07:22:41,2,5,Lower Manhattan,57,3.1,Tea,Brewed Chai tea,Spicy Eye Opener Chai Lg

### EDA

In [6]:
oldest_datetime = df['transaction_date'].min()
newest_datetime = df['transaction_date'].max()

print("Oldest datetime:", oldest_datetime)
print("Newest datetime:", newest_datetime)

Oldest datetime: 2023-01-01 00:00:00
Newest datetime: 2023-06-30 00:00:00

Check the dataset for the year(s) and month(s)

In [7]:
# Get unique years
unique_years = df['transaction_date'].dt.year.unique()
unique_years

array([2023])

Since we only have one year to analyse, we only need to create the month column

In [8]:
# Get unique months
unique_months = df['transaction_date'].dt.month.unique()
unique_months

array([1, 2, 3, 4, 5, 6])

**The dataset contains January to June 2024 transactions**